package com.edu.gdufs.edin.demo.test;

import java.sql.Date;
import java.text.ParseException;
import java.text.SimpleDateFormat;

import org.hibernate.Session;
import org.hibernate.SessionFactory;
import org.hibernate.Transaction;
import org.hibernate.cfg.Configuration;

import com.edu.gdufs.edin.demo.model.News;

public class HibernateTest {
	
	public static void main(String args[]) throws ParseException{
		
		
		Configuration conf = new Configuration().configure();
		SessionFactory sf = conf.buildSessionFactory();
		Session sess = sf.openSession();
		Transaction tx = sess.beginTransaction();
		News n = new News();
		n.setTitle("发改委：研究缩短油价22天调整周期,取消4%限制");
		SimpleDateFormat sdf = new SimpleDateFormat("yyyy年MM月dd日");
		n.setDate(new Date(sdf.parse("2013年03月06日").getTime()));
		n.setSource("新华网");
		n.setContent("    3月6日，国家发改委主任张平就“经济社会发展与宏观调控”答记者问    3月6日（星期三）上午10时，十二届全国人大一次会议新闻中心在梅地亚中心多功能厅举行记者会，国家发展和改革委员会主任张平就“经济社会发展与宏观调控”的相关问题回答中外记者的提问。    [凤凰卫视记者]我们看到经历上个月24号油价涨价之后有大学生向发改委提出申请，要求公开涨价的依据，而且我们注意到行政规定在15个工作日回复，想问发改委在这方面的情况。每一次油价提价都会引起老百姓对于垄断的担忧，能否从国务院机构改革以及理顺能源资源价格方面给我们做解答。    [张平]你问了很敏感的问题，而且我想我的回答可能并不会使你满意或者说还有很多批评的意见。我们的油价定价机制从1998年就开始和国际接轨，按照国际价格来确定我们国内相应的成品油价格以及其他一些化工产品的价格。我们能源消费，特别是石油消费对外依存度不断提高，去年我们自己生产的原油是2亿零400万吨，进口是2亿8000万吨，我们石油的对外依存度已经是58%左右。这些石油都是在国际市场上采购的，对于我们自己生产的这一部分，应该说我们生产的成本会低于国际市场采购的价格。正因为如此，国家从2006年，也就是国际油价开始比较大幅度上升的时点上，就征收石油特别收益金，因为过去石油的价格是三四十美元，当时到了一百多美元。这里有生产成本提高的成份，也有供求关系改变所引发的价格的变动，也包括地缘政治造成的影响。另外也不可否认，这里面还有一些游资炒作的因素。大家可能都还没有忘记在2007年的8月份国际油价最高的时候达到了147-148美元一桶，当然我们的成本没有这么高，所以国家财政就是从我们自己生产的原油中提取了特别收益金，就是要石油生产企业，你生产多少油得向国家交多少钱，这个钱做什么呢？对农业、林业、渔业、公共交通、农村交通实行补贴。现在我们有农机补贴、林业补贴、草原的补贴、城市公交的补贴、农村客运的补贴，对于出租车我们采取了类似补贴的方式。    现在油价的定价机制是以22个工作日为周期，如果平均油价的波动超过了4%，我们就相应进行油价的调整。现在的操作一直是按照这样的机制来操作。这个机制现在看来有两个明显的缺点：一是周期太长，22个工作日再加上节假日就是一个月的时间，现在国际的油价是每一天都在变动，所以我们因为时间长，就不能够及时地反映国际油价变动的情况。二是我们设定了一个调价的油价变动幅度要达到4%，这22个工作日油价如果国际的波动达到4%，我们就调。如果达不到4%，油价就保持稳定，不调，这就造成国际油价变动不能够及时反映到我们国内成品油的价格上来，大的方面是存在这两个缺陷。    去年我们调了八次油价，是四升四降，调升四次，调降四次。成品油的消费涉及到千家万户，涨价的时候对消费者来说不是一个好消息，所以大家有批评的意见，这方面社会上也有很多的反映，包括编了很多的段子，许多朋友都说给我听。说国家发改委一调油价，航空公司就要出事。前两天调油价是发生了地震，把这些都联系起来。我刚才说油价是按照形成机制来确定的，特别是最近几年严格按照这个机制走，从一定意义上说，今年最后一次调油价，窗口期应该是2月9号前后，因为是春节，所以我们一直等到2月24号的夜里，也就是过了正月十五以后才调的。这样正好遇到了国际油价那两天又向下走，由原来116美元降到113美元，但是我们原来油价的定价水平大体上是108到109，还是处在调价的窗口期，我们还是按照机制走，所以社会上也有很多批评的意见，这些我都听到了，也都理解。    我们现在正在研究油价形成机制的改革方案，针对我刚才说的两个突出的缺陷，一是周期太长，我们计划把周期能够调得更短一些，以使得能够适应国际油价频繁变动。二是准备取消4%，按照一定的周期该调就调，不管达没达到4%，我们该升就升，该降就降，使油价定价机制更加灵活，更加适应国际市场的变动。不知道我说清楚没有，可能有不少记者朋友也关心油价的问题，大体上就是现在这样的一个基本考虑。 ");
		sess.save(n);
		tx.commit();
		sess.close();
		sf.close();
		System.out.println("finished");
		
	}

}
